espressif/esp-idf/examples/bluetooth/nimble/power_save/sdkconfig.defaults.esp32c2
CONFIG_IDF_TARGET="esp32c2"

# Bluetooth Low Power Config
CONFIG_BT_LE_SLEEP_ENABLE=y
CONFIG_BT_LE_LP_CLK_SRC_DEFAULT=y

# XTAL Freq Config
CONFIG_XTAL_FREQ_26=y
CONFIG_XTAL_FREQ=26

#
# Sleep Config
#
CONFIG_ESP_SLEEP_POWER_DOWN_FLASH=y

# RTC clock source
CONFIG_RTC_CLK_SRC_EXT_OSC=y
